# Author: Li tianyang
面向过程介绍:Procedural programming uses a list of instructions to tell the computer what to do step-by-step.
面向对象介绍:
            世界万物，皆可分类。
            世界万物，皆为对象。

            只要是对象，就肯定属于某种品类。
            只要是对象，就肯定有属性（功能,名字）。



特性
class
object

封装: 在类中对数据的赋值、内部调用对外部用户是透明的(不能访问，也不需要关心)，这使类变成了一个胶囊或容器，里面包含着类的数据和方法
继承: 一个类可以派生出子类，在这个父类里定义的属性、方法自动被子类继承
多态: 多态是面向对象的重要特性,简单点说:“一个接口，多种实现”，指一个基类中派生出了不同的子类，
     且每个子类在继承了同样的方法名的同时又对父类的方法做了不同的实现，这就是同一种事物表现出的多种形态。



语法
属性
方法
构造函数
析构函数: 在实例释放、销毁的时候执行的，通常用于做一些收尾工作，如关闭一些数据库链接、打开的临时文件


私有方法，私有属性

类变量
实例变量

无论用什么形式来编程，我们都要明确记住以下原则：
1.写重复代码是非常不好的低级行为
2.你写的代码需要经常变更


